stm32-rs/stm32g0xx-hal/src/serial/usart.rs
                    // Enable transmission and receiving
                    usart.cr1.write(|w| {
                        w.te()
                            .set_bit()
                            .re()
                            .set_bit()
                            .m0()
                            .bit(config.wordlength == WordLength::DataBits9)
                            .m1()
                            .bit(config.wordlength == WordLength::DataBits7)
                            .pce()
                            .bit(config.parity != Parity::ParityNone)
                            .ps()
                            .bit(config.parity == Parity::ParityOdd)
                    });
                    usart.cr2.write(|w| unsafe {
                        w.stop()
                            .bits(match config.stopbits {
                                StopBits::STOP1 => 0b00,
                                StopBits::STOP0P5 => 0b01,
                                StopBits::STOP2 => 0b10,
                                StopBits::STOP1P5 => 0b11,
                            })
                            .swap()
                            .bit(config.swap)
                    });

                    // Enable pins
                    tx.setup();
                    rx.setup();

                    // Enable USART
                    usart.cr1.modify(|_, w| w.ue().set_bit());

                    Ok(Serial {
                        tx: Tx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        rx: Rx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        usart,
                        _config: PhantomData,
                    })
                }

                pub fn [< $usartX _with_driver_enable >]<TX, RX, DE>(
                    usart: $USARTX,
                    tx: TX,
                    rx: RX,
                    de: DE,
                    config: BasicConfig,
                    rcc: &mut Rcc,
                ) -> Result<Self, InvalidConfig>
                where
                    TX: TxPin<$USARTX>,
                    RX: RxPin<$USARTX>,
                    DE: DePin<$USARTX>,
                {
                    // Enable clock for USART
                    $USARTX::enable(rcc);

                    let clk = rcc.clocks.apb_clk.raw() as u64;
                    let bdr = config.baudrate.0 as u64;
                    let div = ($clk_mul * clk) / bdr;
                    usart.brr.write(|w| unsafe { w.bits(div as u32) });
                    // Reset other registers to disable advanced USART features
                    usart.cr2.reset();
                    usart.cr3.reset();

                    // Disable USART, there are many bits where UE=0 is required
                    usart.cr1.modify(|_, w| w.ue().clear_bit());

                    // Enable transmission and receiving
                    usart.cr1.write(|w| {
                        w.te()
                            .set_bit()
                            .re()
                            .set_bit()
                            .m0()
                            .bit(config.wordlength == WordLength::DataBits9)
                            .m1()
                            .bit(config.wordlength == WordLength::DataBits7)
                            .pce()
                            .bit(config.parity != Parity::ParityNone)
                            .ps()
                            .bit(config.parity == Parity::ParityOdd)
                    });
                    usart.cr2.write(|w| unsafe {
                        w.stop()
                            .bits(match config.stopbits {
                                StopBits::STOP1 => 0b00,
                                StopBits::STOP0P5 => 0b01,
                                StopBits::STOP2 => 0b10,
                                StopBits::STOP1P5 => 0b11,
                            })
                            .swap()
                            .bit(config.swap)
                    });
                    usart.cr3.write(|w| {
                        w.dem().set_bit()
                    });

                    // Enable pins
                    tx.setup();
                    rx.setup();
                    de.setup();

                    // Enable USART
                    usart.cr1.modify(|_, w| w.ue().set_bit());

                    Ok(Serial {
                        tx: Tx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        rx: Rx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        usart,
                        _config: PhantomData,
                    })
                }

                /// Starts listening for an interrupt event
                pub fn listen(&mut self, event: Event) {
                    match event {
                        Event::Rxne => self.usart.cr1.modify(|_, w| w.rxneie().set_bit()),
                        Event::Txe => self.usart.cr1.modify(|_, w| w.txeie().set_bit()),
                        Event::Idle => self.usart.cr1.modify(|_, w| w.idleie().set_bit()),
                        _ => {}
                    }
                }

                /// Stop listening for an interrupt event
                pub fn unlisten(&mut self, event: Event) {
                    match event {
                        Event::Rxne => self.usart.cr1.modify(|_, w| w.rxneie().clear_bit()),
                        Event::Txe => self.usart.cr1.modify(|_, w| w.txeie().clear_bit()),
                        Event::Idle => self.usart.cr1.modify(|_, w| w.idleie().clear_bit()),
                        _ => {}
                    }
                }

                /// Check if interrupt event is pending
                pub fn is_pending(&mut self, event: Event) -> bool {
                    (self.usart.isr.read().bits() & event.val()) != 0
                }

