stm32-rs/stm32g0xx-hal/src/serial/usart.rs
                /// Clear pending interrupt
                pub fn unpend(&mut self, event: Event) {
                    // mask the allowed bits
                    let mask: u32 = 0x123BFF;
                    self.usart
                        .icr
                        .write(|w| unsafe { w.bits(event.val() & mask) });
                }
            }
        }
    };
}

macro_rules! uart_full {
    ($USARTX:ident,
        $usartX:ident, $clk_mul:expr
    ) => {
        paste! {
            impl SerialExt<$USARTX, FullConfig> for $USARTX {
                fn usart<TX, RX>(
                    self,
                    tx: TX,
                    rx: RX,
                    config: FullConfig,
                    rcc: &mut Rcc,
                ) -> Result<Serial<$USARTX, FullConfig>, InvalidConfig>
                where
                    TX: TxPin<$USARTX>,
                    RX: RxPin<$USARTX>,
                {
                    Serial::$usartX(self, tx, rx, config, rcc)
                }

                fn usart_with_driver_enable<TX, RX, DE>(
                    self,
                    tx: TX,
                    rx: RX,
                    de: DE,
                    config: FullConfig,
                    rcc: &mut Rcc,
                ) -> Result<Serial<$USARTX, FullConfig>, InvalidConfig>
                where
                    TX: TxPin<$USARTX>,
                    RX: RxPin<$USARTX>,
                    DE: DePin<$USARTX>,
                {
                    Serial::[< $usartX _with_driver_enable>](self, tx, rx, de, config, rcc)
                }
            }

            impl Serial<$USARTX, FullConfig> {
                pub fn $usartX<TX, RX>(
                    usart: $USARTX,
                    tx: TX,
                    rx: RX,
                    config: FullConfig,
                    rcc: &mut Rcc,
                ) -> Result<Self, InvalidConfig>
                where
                    TX: TxPin<$USARTX>,
                    RX: RxPin<$USARTX>,
                {
                    // Enable clock for USART
                    $USARTX::enable(rcc);

                    let clk = rcc.clocks.apb_clk.raw() as u64;
                    let bdr = config.baudrate.0 as u64;
                    let clk_mul = 1;
                    let div = (clk_mul * clk) / bdr;
                    usart.brr.write(|w| unsafe { w.bits(div as u32) });

                    usart.cr1.reset();
                    usart.cr2.reset();
                    usart.cr3.reset();

                    usart.cr2.write(|w| unsafe {
                        w.stop()
                            .bits(config.stopbits.bits())
                            .swap()
                            .bit(config.swap)
                    });

                    if let Some(timeout) = config.receiver_timeout {
                        usart.cr1.write(|w| w.rtoie().set_bit());
                        usart.cr2.modify(|_, w| w.rtoen().set_bit());
                        usart.rtor.write(|w| unsafe { w.rto().bits(timeout) });
                    }

                    usart.cr3.write(|w| unsafe {
                        w.txftcfg()
                            .bits(config.tx_fifo_threshold.bits())
                            .rxftcfg()
                            .bits(config.rx_fifo_threshold.bits())
                            .txftie()
                            .bit(config.tx_fifo_interrupt)
                            .rxftie()
                            .bit(config.rx_fifo_interrupt)
                    });

                    usart.cr1.modify(|_, w| {
                        w.ue()
                            .set_bit()
                            .te()
                            .set_bit()
                            .re()
                            .set_bit()
                            .m0()
                            .bit(config.wordlength == WordLength::DataBits7)
                            .m1()
                            .bit(config.wordlength == WordLength::DataBits9)
                            .pce()
                            .bit(config.parity != Parity::ParityNone)
                            .ps()
                            .bit(config.parity == Parity::ParityOdd)
                            .fifoen()
                            .bit(config.fifo_enable)
                    });

                    tx.setup();
                    rx.setup();

                    Ok(Serial {
                        tx: Tx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        rx: Rx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        usart,
                        _config: PhantomData,
                    })
                }

                pub fn [< $usartX _with_driver_enable>]<TX, RX, DE>(
                    usart: $USARTX,
                    tx: TX,
                    rx: RX,
                    de: DE,
                    config: FullConfig,
                    rcc: &mut Rcc,
                ) -> Result<Self, InvalidConfig>
                where
                    TX: TxPin<$USARTX>,
                    RX: RxPin<$USARTX>,
                    DE: DePin<$USARTX>,
                {
                    // Enable clock for USART
                    $USARTX::enable(rcc);

                    let clk = rcc.clocks.apb_clk.raw() as u64;
                    let bdr = config.baudrate.0 as u64;
                    let clk_mul = 1;
                    let div = (clk_mul * clk) / bdr;
                    usart.brr.write(|w| unsafe { w.bits(div as u32) });

                    usart.cr1.reset();
                    usart.cr2.reset();
                    usart.cr3.reset();

                    usart.cr2.write(|w| unsafe {
                        w.stop()
                            .bits(config.stopbits.bits())
                            .swap()
                            .bit(config.swap)
                    });

                    if let Some(timeout) = config.receiver_timeout {
                        usart.cr1.write(|w| w.rtoie().set_bit());
                        usart.cr2.modify(|_, w| w.rtoen().set_bit());
                        usart.rtor.write(|w| unsafe { w.rto().bits(timeout) });
                    }

                    usart.cr3.write(|w| unsafe {
                        w.dem()
                            .set_bit()
                            .txftcfg()
                            .bits(config.tx_fifo_threshold.bits())
                            .rxftcfg()
                            .bits(config.rx_fifo_threshold.bits())
                            .txftie()
                            .bit(config.tx_fifo_interrupt)
                            .rxftie()
                            .bit(config.rx_fifo_interrupt)
                    });

