stm32-rs/stm32g0xx-hal/src/serial/usart.rs
                    usart.cr1.modify(|_, w| {
                        w.ue()
                            .set_bit()
                            .te()
                            .set_bit()
                            .re()
                            .set_bit()
                            .m0()
                            .bit(config.wordlength == WordLength::DataBits7)
                            .m1()
                            .bit(config.wordlength == WordLength::DataBits9)
                            .pce()
                            .bit(config.parity != Parity::ParityNone)
                            .ps()
                            .bit(config.parity == Parity::ParityOdd)
                            .fifoen()
                            .bit(config.fifo_enable)
                    });

                    tx.setup();
                    rx.setup();
                    de.setup();

                    Ok(Serial {
                        tx: Tx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        rx: Rx {
                            _usart: PhantomData,
                            _config: PhantomData,
                        },
                        usart,
                        _config: PhantomData,
                    })
                }

                /// Starts listening for an interrupt event
                pub fn listen(&mut self, event: Event) {
                    match event {
                        Event::Rxne => self.usart.cr1.modify(|_, w| w.rxneie().set_bit()),
                        Event::Txe => self.usart.cr1.modify(|_, w| w.txeie().set_bit()),
                        Event::Idle => self.usart.cr1.modify(|_, w| w.idleie().set_bit()),
                        _ => {}
                    }
                }

                /// Stop listening for an interrupt event
                pub fn unlisten(&mut self, event: Event) {
                    match event {
                        Event::Rxne => self.usart.cr1.modify(|_, w| w.rxneie().clear_bit()),
                        Event::Txe => self.usart.cr1.modify(|_, w| w.txeie().clear_bit()),
                        Event::Idle => self.usart.cr1.modify(|_, w| w.idleie().clear_bit()),
                        _ => {}
                    }
                }

                /// Check if interrupt event is pending
                pub fn is_pending(&mut self, event: Event) -> bool {
                    (self.usart.isr.read().bits() & event.val()) != 0
                }

                /// Clear pending interrupt
                pub fn unpend(&mut self, event: Event) {
                    // mask the allowed bits
                    let mask: u32 = 0x123BFF;
                    self.usart
                        .icr
                        .write(|w| unsafe { w.bits(event.val() & mask) });
                }
            }
            impl Tx<$USARTX, FullConfig> {
                /// Returns true if the tx fifo threshold has been reached.
                pub fn fifo_threshold_reached(&self) -> bool {
                    let usart = unsafe { &(*$USARTX::ptr()) };
                    usart.isr.read().txft().bit_is_set()
                }
            }

            impl Rx<$USARTX, FullConfig> {
                /// Check if receiver timeout has lapsed
                /// Returns the current state of the ISR RTOF bit
                pub fn timeout_lapsed(&self) -> bool {
                    let usart = unsafe { &(*$USARTX::ptr()) };
                    usart.isr.read().rtof().bit_is_set()
                }

                /// Clear pending receiver timeout interrupt
                pub fn clear_timeout(&mut self) {
                    let usart = unsafe { &(*$USARTX::ptr()) };
                    usart.icr.write(|w| w.rtocf().set_bit());
                }

                /// Returns true if the rx fifo threshold has been reached.
                pub fn fifo_threshold_reached(&self) -> bool {
                    let usart = unsafe { &(*$USARTX::ptr()) };
                    usart.isr.read().rxft().bit_is_set()
                }
            }
        }
    };
}

uart_shared!(USART1, USART1_RX, USART1_TX,
    tx: [
        (PA9, AltFunction::AF1),
        (PB6, AltFunction::AF0),
        (PC4, AltFunction::AF1),
    ],
    rx: [
        (PA10, AltFunction::AF1),
        (PB7, AltFunction::AF0),
        (PC5, AltFunction::AF1),
    ],
    de: [
        (PA12, AltFunction::AF1),
        (PB3, AltFunction::AF4),
    ]
);

uart_shared!(USART2, USART2_RX, USART2_TX,
    tx: [
        (PA2, AltFunction::AF1),
        (PA14, AltFunction::AF1),
        (PD5, AltFunction::AF0),
    ],
    rx: [
        (PA3, AltFunction::AF1),
        (PA15, AltFunction::AF1),
        (PD6, AltFunction::AF0),
    ],
    de: [
        (PA1, AltFunction::AF1),
        (PD4, AltFunction::AF0),
    ]
);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_shared!(USART3, USART3_RX, USART3_TX,
    tx: [
        (PA5, AltFunction::AF4),
        (PB2, AltFunction::AF4),
        (PB8, AltFunction::AF4),
        (PB10, AltFunction::AF4),
        (PC4, AltFunction::AF1),
        (PC10, AltFunction::AF1),
        (PD8, AltFunction::AF1),
    ],
    rx: [
        (PB0, AltFunction::AF4),
        (PB9, AltFunction::AF4),
        (PB11, AltFunction::AF4),
        (PC5, AltFunction::AF1),
        (PC11, AltFunction::AF1),
        (PD9, AltFunction::AF1),
    ],
    de: [
        (PA15, AltFunction::AF5),
        (PB1, AltFunction::AF4),
        (PB14, AltFunction::AF4),
        (PD2, AltFunction::AF0),
        (PD12, AltFunction::AF0),
    ]
);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_shared!(USART4, USART4_RX, USART4_TX,
    tx: [
        (PA0, AltFunction::AF4),
        (PC10, AltFunction::AF1),
    ],
    rx: [
        (PC11, AltFunction::AF1),
        (PA1, AltFunction::AF4),
    ],
    de: [
        (PA15, AltFunction::AF4),
    ]
);

#[cfg(feature = "stm32g0x1")]
uart_shared!(LPUART, LPUART_RX, LPUART_TX,
    tx: [
        (PA2, AltFunction::AF6),
        (PB11, AltFunction::AF1),
        (PC1, AltFunction::AF1),
    ],
    rx: [
        (PA3, AltFunction::AF6),
        (PB10, AltFunction::AF1),
        (PC0, AltFunction::AF1),
    ],
    de: [
        (PB1, AltFunction::AF6),
        (PB12, AltFunction::AF1),
    ]
);

uart_full!(USART1, usart1, 1);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_full!(USART2, usart2, 1);

#[cfg(any(feature = "stm32g030", feature = "stm32g031", feature = "stm32g041"))]
uart_basic!(USART2, usart2, 1);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_basic!(USART3, usart3, 1);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_basic!(USART4, usart4, 1);

// LPUART Should be given its own implementation when it needs to be used with features not present on
// the basic feature set such as: Dual clock domain, FIFO or prescaler.
// Or when Synchronous mode is implemented for the basic feature set, since the LP feature set does not have support.
#[cfg(feature = "stm32g0x1")]
uart_basic!(LPUART, lpuart, 256);
